app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY title ASC
SELECT "movies".* FROM "movies" ORDER BY title
SELECT "movies".* FROM "movies" ORDER BY release_date
---
  def index
    if update_session
      flash.keep
      redirect_to movies_path(params)
      return
    end
    @movies = Movie.scoped
    @movies = @movies.where(:rating => params[:ratings].keys)
    if params[:sort_by] == 'title'
      @movies = @movies.order('title ASC')
      @title_class = :hilite
    elsif params[:sort_by] == 'release'
      @movies = @movies.order('release_date ASC')